InformationRegisters/ДанныеНаложенныхПлатежейСервисДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДанныеНаложенныхПлатежейСервисДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбработкиНаложенныхПлатежейСервисДоставки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗаказаСервисДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникГрузоперевозкиСервисДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникГрузоперевозкиСервисДоставки</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОрганизацияБизнесСети</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияОбработкиНаложенныхПлатежейСервисДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияОбработкиНаложенныхПлатежейСервисДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обработать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ДанныеНаложенныхПлатежейСервисДоставки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Новый отбор записей.
// 
// Возвращаемое значение:
//  Структура - Отбор для удаления:
// * ОрганизацияБизнесСети - Неопределено -
// * СписокИдентификаторов - Неопределено -
// * УдалитьОбработанные - Булево -
Функция НовыйОтборЗаписей() Экспорт
	
	ОтборДляУдаления = Новый Структура();
	ОтборДляУдаления.Вставить("ОрганизацияБизнесСети", Неопределено);
	ОтборДляУдаления.Вставить("СписокИдентификаторов", Неопределено);
	ОтборДляУдаления.Вставить("УдалитьОбработанные", Ложь);

	Возврат ОтборДляУдаления
	
КонецФункции

// Удалить записи по отбору.
// 
// Параметры:
//  ОтборДляУдаления - Структура - Отбор для удаления:
// * ОрганизацияБизнесСети - Неопределено -
// * СписокИдентификаторов - Неопределено -
// * УдалитьОбработанные - Булево -
Процедура УдалитьЗаписиПоОтбору(ОтборДляУдаления) Экспорт
	
	МассивЗамен = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеДляОбработкиПоНаложеннымПлатежам.ОрганизацияБизнесСети,
		|	ДанныеДляОбработкиПоНаложеннымПлатежам.ИдентификаторДокумента
		|ИЗ
		|	РегистрСведений.ДанныеНаложенныхПлатежейСервисДоставки КАК ДанныеДляОбработкиПоНаложеннымПлатежам
		|ГДЕ
		|	&УсловияОтбора";

	Если ОтборДляУдаления.ОрганизацияБизнесСети <> Неопределено Тогда
		МассивЗамен.Добавить("ДанныеДляОбработкиПоНаложеннымПлатежам.ОрганизацияБизнесСети = &ОрганизацияБизнесСети");
		Запрос.УстановитьПараметр("ОрганизацияБизнесСети", ОтборДляУдаления.ОрганизацияБизнесСети);
	КонецЕсли;
	
	Если ОтборДляУдаления.СписокИдентификаторов <> Неопределено Тогда
		МассивЗамен.Добавить("ДанныеДляОбработкиПоНаложеннымПлатежам.ИдентификаторДокумента В (&СписокИдентификаторов)");
		Запрос.УстановитьПараметр("СписокИдентификаторов", ОтборДляУдаления.СписокИдентификаторов);
	КонецЕсли;
	
	Если ОтборДляУдаления.УдалитьОбработанные = Истина Тогда
		МассивЗамен.Добавить("ДанныеДляОбработкиПоНаложеннымПлатежам.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОбработкиНаложенныхПлатежейСервисДоставки.Удалить)");
	КонецЕсли;

	Если МассивЗамен.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбора", СтрСоединить(МассивЗамен, " И "));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УдаляемаяЗапись = РегистрыСведений.ДанныеНаложенныхПлатежейСервисДоставки.СоздатьМенеджерЗаписи();
		УдаляемаяЗапись.ОрганизацияБизнесСети = ВыборкаДетальныеЗаписи.ОрганизацияБизнесСети;
		УдаляемаяЗапись.ИдентификаторДокумента = ВыборкаДетальныеЗаписи.ИдентификаторДокумента;
		
		УдаляемаяЗапись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
